Importando as bibliotecas

In [62]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

Variáveis

In [63]:
dict_values = {"dir": fr"C:\Users\letic\OneDrive\Documentos\Projeto Final - BI Master - 2\Arquivos Excel",
    'arq_serv_prestados': 'Serviços Prestados.xlsx',
    #'arq_tarifas': 'Tarifas Realizadas.xlsx',
    'arq_coord': 'Coordenadas Geográficas.xlsx',
    'arq_plataformas': 'Plataformas.xlsx',

    'arq_portos': 'Portos.xlsx',
    'arq_embarcacoes': 'Embarcações.xlsx',

    'arq_aeroportos': 'Aeroportos.xlsx',
    'arq_helicopteros': 'Helicópteros.xlsx',

}

Lendo os arquivos Excel

In [64]:
# 1. Serviços Prestados
df_servicos = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_serv_prestados"]}')
df_servicos.head()

,Código do Serviço,Descrição do Serviço,Modal de Transporte,Tipo
0,SBME_Carga,Transporte Aéreo de Cargas - Macaé,Aéreo,Carga
1,SBME_Pax,Transporte Aéreo de Passageiros - Macaé,Aéreo,Passageiro
2,SBRJ_Carga,Transporte Aéreo de Cargas - Rio de Janeiro,Aéreo,Carga
3,SBRJ_Pax,Transporte Aéreo de Passageiros - Rio de Janeiro,Aéreo,Passageiro
4,SBVT_Carga,Transporte Aéreo de Cargas - Vitória,Aéreo,Carga

In [65]:
# 3. Portos 
df_portos = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_portos"]}')
df_portos.head()

   Código                     Nome
0    PRIO  Porto do Rio de Janeiro
1  PMACAE           Porto de Macaé

In [66]:
# 4. Aeroportos
df_aeroportos = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_aeroportos"]}')
df_aeroportos.head()

  Código                         Nome
0   SBRJ  Aeroporto do Rio de Janeiro
1   SBME           Aeroporto de Macaé
2   SBVT         Aeroporto de Vitória

In [67]:
# 5. Plataformas
df_plat = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_plataformas"]}')
df_plat.head()

  Código                Nome
0   P-01  Plataforma XPTO 01
1   P-02  Plataforma XPTO 02
2   P-03  Plataforma XPTO 03
3   P-04  Plataforma XPTO 04
4   P-05  Plataforma XPTO 05

In [68]:
# 6. Coordenadas Geográficas
df_coord = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_coord"]}')
df_coord.head()

    Local   Latitude  Longitude
0    PRIO -22.896593 -43.178433
1  PMACAE -22.385199 -41.765990
2    SBRJ -22.987429 -43.369650
3    SBME -22.341601 -41.762751
4    SBVT -20.255172 -40.280096

In [69]:
# 7. Embarcações
df_emb = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_embarcacoes"]}')
df_emb.head()

        Nome    Modelo    Porte
0    Titanic  PSV 3000   Grande
1    Olympic  PSV 3000   Grande
2  Britannic  PSV 1500    Médio
3  Spartakus   UT 4000    Médio
4    Antares   LH 2500  Pequeno

In [70]:
# 8. Helicópteros
df_hel = pd.read_excel(f'{dict_values["dir"]}\{dict_values["arq_helicopteros"]}')
df_hel.head()

     Nome Modelo   Porte
0  PR-ABC    S92   Médio
1  PT-DEF    S92   Médio
2  PR-XYZ    S92   Médio
3  PU-KRT   S92+  Grande
4  PR-LMN    S92   Médio

Funções DW

In [71]:
def conect_dw():
    conn_string = 'postgresql://postgres:postgres@localhost/dw_logistica'
    db = create_engine(conn_string)
    conn = psycopg2.connect(conn_string)
    return conn, db

In [72]:
def close_dw(conn):
    conn.close()

In [73]:
def truncate_table_dw(tabela):
    conn = psycopg2.connect('postgresql://postgres:postgres@localhost/dw_logistica')
    cursor = conn.cursor()
    cursor.execute(f'TRUNCATE TABLE {tabela} RESTART IDENTITY CASCADE')
    conn.commit()

In [74]:
def escrever_tab_dim_dw(df, tabela):
    conn, db = conect_dw()
    truncate_table_dw(tabela)
    df.to_sql(tabela, schema='public', con=db, if_exists='append', index=False)

In [75]:
def ler_tabela_dw(tabela):
    con = conect_dw()
    df = pd.read_sql(f'SELECT * FROM {tabela}', con[0])
    return df

In [76]:
def criar_dim_data():
    conn = psycopg2.connect('postgresql://postgres:postgres@localhost/dw_logistica')
    cursor = conn.cursor()
    sql_query = """INSERT INTO dim_data (nk_data, dia, mes_calendario, ano_calendario) 
                    SELECT 
	                    nk_data, 
	                    extract(day from nk_data) as dia,
	                    extract(month from nk_data) as mes_calendario,
	                    extract(year from nk_data) as ano_calendario
                    FROM (
	                    ---incluir aqui a data de início do script, criaremos 15 anos de datas
	                    select '2022-01-01'::date + sequence.day as nk_data
	                    from generate_series(0,5479) as sequence(day)
	                    group by sequence.day
	                order by 1
                ) as tabela_datas;"""
    cursor.execute(sql_query)
    conn.commit()

Tabelas Dimensão

In [77]:
#dim_data
truncate_table_dw('dim_data')
criar_dim_data()

dim_data = ler_tabela_dw('dim_data')
dim_data.head()

C:\Users\letic\AppData\Local\Temp\ipykernel_5740\3090770461.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(f'SELECT * FROM {tabela}', con[0])

   sk_data     nk_data  dia  mes_calendario  ano_calendario
0        1  2022-01-01    1               1            2022
1        2  2022-01-02    2               1            2022
2        3  2022-01-03    3               1            2022
3        4  2022-01-04    4               1            2022
4        5  2022-01-05    5               1            2022

In [78]:
#dim_servico
dim_servico = df_servicos

dim_servico = dim_servico.rename({'Código do Serviço': 'nk_servico', 
                                  'Descrição do Serviço': 'descricao',
                                  'Modal de Transporte': 'modal',
                                  'Tipo': 'tipo'}, 
                                 axis=1)

In [79]:
escrever_tab_dim_dw(dim_servico, 'dim_servico')

In [80]:
dim_servico = ler_tabela_dw('dim_servico')
dim_servico.head()

C:\Users\letic\AppData\Local\Temp\ipykernel_5740\3090770461.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(f'SELECT * FROM {tabela}', con[0])

,sk_servico,nk_servico,descricao,modal,tipo
0,1,SBME_Carga,Transporte Aéreo de Cargas - Macaé,Aéreo,Carga
1,2,SBME_Pax,Transporte Aéreo de Passageiros - Macaé,Aéreo,Passageiro
2,3,SBRJ_Carga,Transporte Aéreo de Cargas - Rio de Janeiro,Aéreo,Carga
3,4,SBRJ_Pax,Transporte Aéreo de Passageiros - Rio de Janeiro,Aéreo,Passageiro
4,5,SBVT_Carga,Transporte Aéreo de Cargas - Vitória,Aéreo,Carga

In [81]:
#dim_local
df_portos = df_portos.rename({'Código': 'nk_local', 
                            'Nome': 'descricao'},
                        axis=1)
df_portos.insert(len(df_portos.columns), column='tipo', value='Porto')
df_portos.head()

  nk_local                descricao   tipo
0     PRIO  Porto do Rio de Janeiro  Porto
1   PMACAE           Porto de Macaé  Porto

In [82]:
df_aeroportos = df_aeroportos.rename({'Código': 'nk_local', 
                                    'Nome': 'descricao'},
                                 axis=1)
df_aeroportos.insert(len(df_aeroportos.columns), column='tipo', value='Aeroporto')
df_aeroportos.head()

  nk_local                    descricao       tipo
0     SBRJ  Aeroporto do Rio de Janeiro  Aeroporto
1     SBME           Aeroporto de Macaé  Aeroporto
2     SBVT         Aeroporto de Vitória  Aeroporto

In [83]:
df_plat = df_plat.rename({'Código': 'nk_local', 
                            'Nome': 'descricao'},
                    axis=1)
df_plat.insert(len(df_plat.columns), column='tipo', value='Plataforma')
df_plat.head()

  nk_local           descricao        tipo
0     P-01  Plataforma XPTO 01  Plataforma
1     P-02  Plataforma XPTO 02  Plataforma
2     P-03  Plataforma XPTO 03  Plataforma
3     P-04  Plataforma XPTO 04  Plataforma
4     P-05  Plataforma XPTO 05  Plataforma

In [84]:
dim_local = pd.DataFrame([['NA', 'NA', 'NA']], columns=['nk_local', 'descricao', 'tipo'])

In [85]:
dim_local = pd.concat([dim_local, df_plat], ignore_index=True)
dim_local = pd.concat([dim_local, df_portos], ignore_index=True)
dim_local = pd.concat([dim_local, df_aeroportos], ignore_index=True)

In [86]:
dim_local.head()

  nk_local           descricao        tipo
0       NA                  NA          NA
1     P-01  Plataforma XPTO 01  Plataforma
2     P-02  Plataforma XPTO 02  Plataforma
3     P-03  Plataforma XPTO 03  Plataforma
4     P-04  Plataforma XPTO 04  Plataforma

In [87]:
df_coord = df_coord.rename({'Local': 'nk_local'},
                    axis=1)
df_coord.head()

  nk_local   Latitude  Longitude
0     PRIO -22.896593 -43.178433
1   PMACAE -22.385199 -41.765990
2     SBRJ -22.987429 -43.369650
3     SBME -22.341601 -41.762751
4     SBVT -20.255172 -40.280096

In [88]:
dim_local = pd.merge(dim_local, df_coord, on='nk_local', how='left')

In [89]:
dim_local['Latitude'] = dim_local['Latitude'].fillna(0)
dim_local['Longitude'] = dim_local['Longitude'].fillna(0)

In [90]:
dim_local = dim_local.rename({'Latitude': 'latitude',
                            'Longitude': 'longitude'},
                    axis=1)

In [91]:
dim_local.head()

  nk_local           descricao        tipo   latitude  longitude
0       NA                  NA          NA   0.000000   0.000000
1     P-01  Plataforma XPTO 01  Plataforma -20.023475 -39.313239
2     P-02  Plataforma XPTO 02  Plataforma -19.335195 -39.151420
3     P-03  Plataforma XPTO 03  Plataforma -22.571216 -40.433197
4     P-04  Plataforma XPTO 04  Plataforma -21.123085 -39.443377

In [92]:
escrever_tab_dim_dw(dim_local, 'dim_local')

In [93]:
dim_local = ler_tabela_dw('dim_local')
dim_local.head()

C:\Users\letic\AppData\Local\Temp\ipykernel_5740\3090770461.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(f'SELECT * FROM {tabela}', con[0])

   sk_local nk_local           descricao        tipo   latitude  longitude
0         1       NA                  NA          NA   0.000000   0.000000
1         2     P-01  Plataforma XPTO 01  Plataforma -20.023476 -39.313240
2         3     P-02  Plataforma XPTO 02  Plataforma -19.335196 -39.151420
3         4     P-03  Plataforma XPTO 03  Plataforma -22.571217 -40.433197
4         5     P-04  Plataforma XPTO 04  Plataforma -21.123085 -39.443380

In [94]:
#dim_equipamento
df_emb = df_emb.rename({'Nome': 'nk_nome', 
                        'Modelo': 'modelo',
                        'Porte': 'porte'},
                axis =1)

In [95]:
df_emb.insert(len(df_emb.columns), column='tipo', value='Embarcação')

In [96]:
df_hel = df_hel.rename({'Nome': 'nk_nome', 
                        'Modelo': 'modelo',
                        'Porte': 'porte'},
                axis =1)

In [97]:
df_hel.insert(len(df_hel.columns), column='tipo', value='Helicóptero')

In [98]:
dim_equipamento = pd.concat([df_emb, df_hel])

In [99]:
dim_equipamento.head()

     nk_nome    modelo    porte        tipo
0    Titanic  PSV 3000   Grande  Embarcação
1    Olympic  PSV 3000   Grande  Embarcação
2  Britannic  PSV 1500    Médio  Embarcação
3  Spartakus   UT 4000    Médio  Embarcação
4    Antares   LH 2500  Pequeno  Embarcação

In [100]:
escrever_tab_dim_dw(dim_equipamento, 'dim_equipamento')

In [101]:
dim_equipamento = ler_tabela_dw('dim_equipamento')
dim_equipamento.head()

C:\Users\letic\AppData\Local\Temp\ipykernel_5740\3090770461.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(f'SELECT * FROM {tabela}', con[0])

   sk_equipamento    nk_nome    modelo    porte        tipo
0               1    Titanic  PSV 3000   Grande  Embarcação
1               2    Olympic  PSV 3000   Grande  Embarcação
2               3  Britannic  PSV 1500    Médio  Embarcação
3               4  Spartakus   UT 4000    Médio  Embarcação
4               5    Antares   LH 2500  Pequeno  Embarcação